Repository: chentianren0/MiniXiangqi
Catalog: apple/MiniXiangqi/Localizable.xcstrings
Source language: en
Languages: zh_hans

# about.build
source: Build
zh_hans: 构建版本

# about.license
source: License
zh_hans: 许可证

# about.license.statement
source: Mini Xiangqi is free software, released under the GNU General Public License v3.
zh_hans: Mini Xiangqi 是自由软件，依据 GNU General Public License v3 发布。

# about.name
source: Name
zh_hans: 名称

# about.source
source: Source Code
zh_hans: 源代码

# about.title
source: About
zh_hans: 关于

# about.version
source: Version
zh_hans: 版本

# alert.aiUnavailable.message
source: There is not enough memory available. Please close some other apps, then try again.
zh_hans: 当前可用内存不足。请尝试关闭一些其他 App，然后重试。

# alert.aiUnavailable.resumeMessage
source: There is not enough memory available. The game is saved and you can continue later. Please close some other apps, then try again.
zh_hans: 当前可用内存不足。对局已保存，可以稍后继续。请尝试关闭一些其他 App，然后重试。

# alert.aiUnavailable.title
source: Couldn't Start the AI Opponent
zh_hans: 无法启动 AI 对手

# alert.claimDraw.message
source: You can end the game as a draw.
zh_hans: 可以和棋结束。

# alert.claimDraw.title
source: This position has occurred three times.
zh_hans: 局面已三次重复

# alert.deleteFailed.message
source: This game is still in History. Please try again.
zh_hans: 这盘棋仍然保留在历史里。请重试。

# alert.deleteFailed.title
source: Couldn't Delete This Game
zh_hans: 无法删除这盘棋

# alert.deleteGame.message
source: This game can't be recovered.
zh_hans: 删除后无法恢复。

# alert.deleteGame.title
source: Delete this game?
zh_hans: 删除这盘棋？

# alert.gameNotStarted.message
source: Saving the new game failed. Please try again.
zh_hans: 保存这盘新对局时出错。请重试。

# alert.gameNotStarted.title
source: Couldn't Start the Game
zh_hans: 无法开始对局

# alert.importConflict.message
source: It is the same game as one in History, but its contents differ. History is unchanged. To use this file, delete that game from History first.
zh_hans: 它和历史中的一盘棋是同一局，但内容不同。历史没有改变。如果要用这个文件，请先删除历史中的那一盘。

# alert.importConflict.title
source: This File Conflicts with a Game in History
zh_hans: 这个文件和历史中的一盘棋冲突

# alert.importDamagedRecord.message
source: The record in History matching this file is damaged, so it can't be compared or imported. To use this file, delete that game from History first.
zh_hans: 这个文件对应的历史记录已损坏，无法比较或导入。如果要用这个文件，请先删除历史中的那一盘。

# alert.importDamagedRecord.title
source: A Game in History Is Damaged
zh_hans: 历史中有一盘损坏的棋

# alert.importDuplicate.message
source: The game in this file is identical to one already in History, so it wasn't added again.
zh_hans: 文件里的对局和历史中的一盘完全相同，所以没有重复添加。

# alert.importDuplicate.title
source: This Game Is Already in History
zh_hans: 这盘棋已经在历史里

# alert.importNewerVersion.message
source: This version can't read it. Update Mini Xiangqi and try again. History is unchanged.
zh_hans: 当前版本无法读取它。请更新 Mini Xiangqi 后再试。历史没有改变。

# alert.importNewerVersion.title
source: This File Was Created by a Newer Version of Mini Xiangqi
zh_hans: 这个文件由更新版本的 Mini Xiangqi 创建

# alert.importSaveFailed.message
source: The game file is fine, but saving it to History failed. History is unchanged. Please try again.
zh_hans: 对局文件没有问题，但保存到历史时出错。历史没有改变。请重试。

# alert.importSaveFailed.title
source: Couldn't Save the Imported Game
zh_hans: 无法保存导入的对局

# alert.importUnreadable.message
source: The file's contents are invalid or too large to import. History is unchanged. Check that the file is complete, or ask for a new copy.
zh_hans: 文件的内容无效或过大，无法导入。历史没有改变。请确认文件完整，或者向对方要一份新的。

# alert.importUnreadable.title
source: Can't Read This Game File
zh_hans: 无法读取这个对局文件

# alert.nearbyDeclined.title
source: The Game Didn't Start
zh_hans: 对局没有开始

# alert.nearbyInvite.message
source: The game starts as soon as you accept.
zh_hans: 接受后立即开始对局。

# alert.nearbyInvite.title
source: Someone Wants to Play
zh_hans: 对方邀请你对弈

# alert.newGame.message
source: This game will be saved to History as it is now.
zh_hans: 这盘对局将按当前状态保存到历史。

# alert.newGame.metadataHeader
source: Current Game
zh_hans: 当前对局

# alert.newGame.title
source: Start a new game?
zh_hans: 开始新对局？

# alert.resign.message
source: Resigning records this game as your loss.
zh_hans: 认输后本局将记为你落败。

# alert.resign.title
source: Resign?
zh_hans: 认输？

# alert.saveFailed.message
source: The current game is unchanged. Please try again.
zh_hans: 当前对局仍然保留。请重试。

# alert.saveFailed.title
source: Couldn't Save the Game
zh_hans: 无法保存对局

# board.a11y.black
source: Black
zh_hans: 黑

# board.a11y.capture
source: Capture
zh_hans: 可吃

# board.a11y.empty
source: Empty
zh_hans: 空

# board.a11y.inCheck
source: In Check
zh_hans: 被将军

# board.a11y.legalMove
source: Legal Move
zh_hans: 可走

# board.a11y.red
source: Red
zh_hans: 红

# board.a11y.selected
source: Selected
zh_hans: 已选择

# control.accept
source: Accept
zh_hans: 接受

# control.cancel
source: Cancel
zh_hans: 取消

# control.claimDraw
source: Claim Draw
zh_hans: 判和

# control.decline
source: Decline
zh_hans: 拒绝

# control.delete
source: Delete
zh_hans: 删除

# control.done
source: Done
zh_hans: 完成

# control.endAsDraw
source: End as a Draw
zh_hans: 以和棋结束

# control.flipBoard
source: Flip Board
zh_hans: 翻转棋盘

# control.import
source: Import…
zh_hans: 导入…

# control.keepPlaying
source: Keep Playing
zh_hans: 继续对局

# control.later
source: Later
zh_hans: 稍后

# control.newGame
source: New Game
zh_hans: 开始新对局

# control.offerDraw
source: Offer Draw
zh_hans: 提和

# control.ok
source: OK
zh_hans: 好

# control.pin
source: Pin
zh_hans: 置顶

# control.replay
source: Replay
zh_hans: 回放

# control.resign
source: Resign
zh_hans: 认输

# control.save
source: Save
zh_hans: 保存

# control.saveAndContinue
source: Save and Continue
zh_hans: 保存并继续

# control.saveAndNewGame
source: Save and New Game
zh_hans: 保存并开始新对局

# control.share
source: Share
zh_hans: 共享

# control.startGame
source: Start Game
zh_hans: 开始对局

# control.tryAgain
source: Try Again
zh_hans: 重试

# control.undo
source: Undo
zh_hans: 悔棋

# control.unpin
source: Unpin
zh_hans: 取消置顶

# control.view
source: View
zh_hans: 查看

# failure.coreDidNotStart
source: The core did not start
zh_hans: 核心未能启动

# failure.gameDidNotStart
source: The game did not start
zh_hans: 对局未能开始

# failure.historyDidNotLoad
source: History did not load
zh_hans: 历史未能载入

# game.miniXiangqi
source: Mini Xiangqi
zh_hans: 迷你象棋

# game.xiangqi
source: Xiangqi
zh_hans: 象棋

# history.empty.description
source: Games you finish are saved here.
zh_hans: 对局结束后会保存到这里。

# history.empty.title
source: No Games Yet
zh_hans: 还没有历史对局

# history.section.others
source: Other Games
zh_hans: 其他对局

# history.section.pinned
source: Pinned
zh_hans: 已置顶

# metadata.imported
source: Imported
zh_hans: 导入

# metadata.inProgress
source: In Progress
zh_hans: 进行中

# metadata.moveCount
source: %lld moves
zh_hans: %lld 步

# metadata.youBlack
source: You: Black
zh_hans: 你执黑

# metadata.youRed
source: You: Red
zh_hans: 你执红

# mode.freePlay
source: Free Play
zh_hans: 自由对弈

# mode.humanVersusAI
source: Human versus AI
zh_hans: 人机对弈

# mode.nearby
source: Nearby Play
zh_hans: 附近对弈

# nav.history
source: History
zh_hans: 历史

# nav.moveList
source: Moves
zh_hans: 棋谱

# nav.play
source: Play
zh_hans: 对局

# nav.resumeGame
source: Resume Game
zh_hans: 回到对局

# nav.settings
source: Settings
zh_hans: 设置

# nearby.agreedDraw
source: Draw by Agreement
zh_hans: 协议和棋

# nearby.connecting
source: Connecting to the other device…
zh_hans: 正在连接对方…

source: Nearby Devices
zh_hans: 附近的设备

# nearby.discoverable
source: Make This Device Discoverable
zh_hans: 让这台设备可被发现

# nearby.ended.disagreement
source: The two devices no longer agree about this game.
zh_hans: 两台设备对这局对弈的记录不一致。

# nearby.ended.newGame
source: They started a new game.
zh_hans: 对方开始了新的对局。

# nearby.ended.title
source: The Game Has Ended
zh_hans: 对局已结束

# nearby.findDevice
source: Find a Device
zh_hans: 查找设备

# nearby.invite
source: Send Invitation
zh_hans: 发出邀请

# nearby.pairing
source: Pairing
zh_hans: 配对

# nearby.pairing.footer
source: Two devices only need to be paired once.
zh_hans: 两台设备只需配对一次。

# nearby.pairing.unavailable
source: This device can't pair
zh_hans: 这台设备无法配对

# nearby.refusal.alreadyPlaying
source: You already have a game with this device.
zh_hans: 你和对方已经有一局对弈了。

# nearby.refusal.busy
source: They're already playing another game.
zh_hans: 对方正在进行另一局对弈。

# nearby.refusal.declined
source: They declined the game.
zh_hans: 对方拒绝了这局对弈。

# nearby.refusal.notNow
source: The game can't start right now. Please try again.
zh_hans: 现在无法开始对局。请重试。

# nearby.refusal.rulesMismatch
source: The two devices read the rules differently. Update both to the latest version and try again.
zh_hans: 两台设备对规则的解读不同。请都更新到最新版本后再试。

# nearby.refusal.settling
source: The last game hasn't finished yet. Please try again in a moment.
zh_hans: 上一局还没有结束。请稍后再试。

# nearby.refusal.unknownGame
source: Their app doesn't play this game.
zh_hans: 对方的 App 不下这个游戏。

# nearby.refusal.unknownSession
source: The other device no longer has this game.
zh_hans: 对方设备上已经没有这局对弈了。

# nearby.searching
source: Looking for nearby devices…
zh_hans: 正在查找附近的设备…

# nearby.theyAskUndo
source: They want to take back a move
zh_hans: 对方请求悔棋

# nearby.theyMoveFirst
source: They Move First
zh_hans: 对方先手

# nearby.theyOfferDraw
source: They offer a draw
zh_hans: 对方提和

# nearby.waitingForAnswer
source: Waiting for a reply…
zh_hans: 正在等待对方回应…

# reason.checkmate
source: Checkmate
zh_hans: 将死

# reason.endedEarly
source: Ended Early
zh_hans: 提前结束

# reason.fiftyMoveRule
source: Fifty-Move Rule
zh_hans: 五十回合规则

# reason.mutualPerpetualChase
source: Mutual Perpetual Chase
zh_hans: 双方长捉

# reason.mutualPerpetualCheck
source: Mutual Perpetual Check
zh_hans: 双方长将

# reason.perpetualChase
source: Perpetual Chase
zh_hans: 长捉

# reason.perpetualCheck
source: Perpetual Check
zh_hans: 长将

# reason.resignation
source: Resignation
zh_hans: 认输

# reason.stalemate
source: Stalemate
zh_hans: 困毙

# reason.threefoldRepetition
source: Threefold Repetition
zh_hans: 三次重复

# replay.autoplay
source: Autoplay
zh_hans: 自动播放

# replay.first
source: Go to Start
zh_hans: 回到开始

# replay.last
source: Go to End
zh_hans: 跳到最后

# replay.next
source: Next Move
zh_hans: 下一步

# replay.pause
source: Pause
zh_hans: 暂停

# replay.previous
source: Previous Move
zh_hans: 上一步

# result.blackWins
source: Black Wins
zh_hans: 黑方获胜

# result.draw
source: Draw
zh_hans: 和棋

# result.recorded
source: Saved to History
zh_hans: 已记录到历史

# result.redWins
source: Red Wins
zh_hans: 红方获胜

# settings.confirmDelete.footer
source: When off, deletion happens immediately. A deletion cannot be undone.
zh_hans: 关闭后，删除立即执行。删除无法撤销。

# settings.confirmDelete.label
source: Confirm Before Deleting
zh_hans: 删除前确认

# settings.defaults.aiLevel
source: Default AI Level
zh_hans: 默认 AI 等级

# settings.defaults.firstMover
source: Default First Mover
zh_hans: 默认先后手

# settings.defaults.footer
source: These settings apply when you start a new Human versus AI game. They don't change a game in progress.
zh_hans: 这些设置用于开始新的人机对弈，不会改变进行中的对局。

# settings.defaults.group
source: Human versus AI Defaults
zh_hans: 人机对弈默认设置

# settings.haptics.label
source: Haptics
zh_hans: 触感

# settings.notation.label
source: Notation
zh_hans: 记谱法

# settings.notation.traditional
source: Chinese
zh_hans: 中文

# settings.section.board
source: Board
zh_hans: 棋盘

# settings.sound.label
source: Sound
zh_hans: 声音

# settings.symbols.hanzi
source: Chinese Characters
zh_hans: 汉字

# settings.symbols.icons
source: Icons
zh_hans: 图标

# settings.symbols.label
source: Piece Symbols
zh_hans: 棋子符号

# setup.aiLevel
source: AI Level
zh_hans: AI 等级

# setup.aiMovesFirst
source: AI Moves First
zh_hans: AI 先手

# setup.firstMover
source: First Mover
zh_hans: 先后手

# setup.freePlayExplanation
source: You control both Red and Black. Red moves first.
zh_hans: 你将控制红黑双方，红方先行。

# setup.iMoveFirst
source: I Move First
zh_hans: 我先手

# setup.level.deep
source: Deep
zh_hans: 深思

# setup.level.fast
source: Fast
zh_hans: 快速

# setup.level.standard
source: Standard
zh_hans: 标准

# setup.random
source: Random
zh_hans: 随机

# setup.thisGame
source: This Game
zh_hans: 本局设置

# status.aiThinking
source: AI is thinking
zh_hans: AI 正在思考

# status.aiUnavailable
source: The AI can't start right now
zh_hans: AI 暂时无法启动

# status.blackToMove
source: Black to Move
zh_hans: 轮到黑方

# status.blackWins
source: Black Wins
zh_hans: 黑方胜

# status.check
source: Check
zh_hans: 将军

# status.controller.peer
source: Them
zh_hans: 对方

# status.controller.you
source: You
zh_hans: 你

# status.draw
source: Draw
zh_hans: 和局

# status.drawAvailable
source: Draw Available
zh_hans: 可判和

# status.redToMove
source: Red to Move
zh_hans: 轮到红方

# status.redWins
source: Red Wins
zh_hans: 红方胜

# status.saveFailed
source: Couldn't save that move. Please try again.
zh_hans: 无法保存这一步，请重试。
